{
  "backend/main.mo": "Main ICP actor implementing user profile storage and project/workflow/task CRUD operations with role-based access control (user/admin permissions) using a MixinAuthorization pattern.",
  "feature_evidence.json": "Feature evidence report listing two features: fixing the frontend post-login profile creation flow and adding proper error surfacing in SetupPage.tsx and useQueries.ts.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing their roles in the chat app UI including hooks, pages, and components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, sidebar, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div and module script entry point, titled 'ChatApp'.",
  "frontend/src/App.tsx": "Root React component that routes between LoginPage, SetupPage, and ChatPage based on authentication state and whether a user profile exists, using isFetched to prevent flash.",
  "frontend/src/components/ChatHeader.tsx": "App header component displaying the logo, a theme toggle button, and a user dropdown menu with sign-out, typed with the ChatUser interface.",
  "frontend/src/components/ConversationList.tsx": "Left sidebar component showing a searchable conversation list with skeleton loading, empty states, and a New Chat dialog for selecting users to message.",
  "frontend/src/components/MessageThread.tsx": "React component that renders a chat message thread for a selected user, including grouped messages by date, a textarea input, and send-on-Enter functionality with error handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, chat users, conversations, and messages against the ICP backend actor, along with shared frontend chat types.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines CSS custom properties for light/dark theme tokens including chat-specific bubble and sidebar colors using OKLCH.",
  "frontend/src/lib/utils.ts": "Exports a single cn utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChatPage.tsx": "Top-level chat page component that manages selected conversation state and responsive mobile/desktop layout between the ConversationList sidebar and MessageThread main panel.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login landing page with Internet Identity authentication, displaying app branding, feature highlights (private, fast, simple), and a sign-in button that triggers the login flow.",
  "frontend/src/pages/SetupPage.tsx": "Renders a first-time setup form where new users enter a display name (2–32 chars), validates input, calls the saveProfile mutation, and invokes onComplete on success.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system: OKLCH-based color tokens, custom fonts (Inter, JetBrains Mono), extended border radii, box shadows, and keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 7) for a one-on-one Internet Computer chat app, listing existing features, known issues (deployment failures, profile creation errors), and architectural notes about polling and Internet Identity auth."
}