{
  "backend/main.mo": "Main ICP actor defining user profiles, projects, workflows, and tasks with CRUD operations, enforcing role-based access control via MixinAuthorization and AccessControl helpers.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: fixing backend call failures after login (registerUser signature, Candid types, SetupPage mutation) and displaying the logged-in user's principal ID in the chat header.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their roles in the chat application's UI, hooks, and styling.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based light and dark theme CSS custom properties for colors, borders, sidebar, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell for the React app, mounting the root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root app component that routes between LoginPage, SetupPage, and ChatPage based on Internet Identity authentication state and whether a user profile exists, with flash-prevention via isFetched guard.",
  "frontend/src/components/ChatHeader.tsx": "App header component displaying the logo, theme toggle, and a user dropdown that shows the authenticated user's display name, truncated principal ID with a copy-to-clipboard button, and a logout option.",
  "frontend/src/components/ConversationList.tsx": "Left sidebar component rendering a searchable conversation list with skeleton loading, empty states, and a New Chat dialog for selecting users to start conversations.",
  "frontend/src/components/MessageThread.tsx": "Renders the message thread panel for a selected chat user, displaying grouped messages by date, a scrollable message list, and a textarea input for sending messages with Enter-key support.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, AuthClient management, and a React context provider/hook for accessing identity state throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile management and chat UI operations (conversations, messages, users), along with frontend-only TypeScript types for chat entities.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, and defines OKLCH-based CSS custom properties for light/dark themes including chat-specific color tokens.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Top-level chat page component that manages selected conversation state and mobile view toggling, composing the ChatHeader, ConversationList sidebar, and MessageThread main panel.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login landing page with Internet Identity sign-in button, feature highlights (Private, Fast, Simple), and branding header.",
  "frontend/src/pages/SetupPage.tsx": "Renders a first-time setup form where newly authenticated users enter a display name (2–32 chars) and register their profile via the backend, with inline error handling.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL/hash query parameters, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system: OKLCH-based color tokens, custom border radii, box shadows, font families, and keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks overall project state (version 9) including architecture notes, known issues (IC deployment failures, registerUser errors), and the list of implemented features for this Internet Computer chat app."
}