{
  "kind": "build_request",
  "title": "Fix post-login request errors and display principal ID in header",
  "projectName": "ChatApp",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Audit and fix all backend call failures occurring after login. Specifically: ensure the `registerUser` function in `backend/main.mo` has the correct signature and stable variable declarations; ensure the frontend actor interface (Candid types) in `frontend/src/hooks/useQueries.ts` exactly matches the deployed backend API; and ensure the `registerUser` mutation in `frontend/src/pages/SetupPage.tsx` correctly invokes the actor with the display name argument. The 'Error in sending request' must no longer appear after a successful login.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2"
        ],
        "quotes": [
          "Error in sending request",
          "Solve it",
          "fixing the registerUser (and any other backend call) that's failing after login"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with Internet Identity, no 'Error in sending request' toast or console error appears",
        "The registerUser mutation successfully creates a user profile on first login",
        "The backend/main.mo compiles without errors and all function signatures match the frontend Candid interface",
        "The frontend useQueries.ts actor interface types match the deployed backend API exactly"
      ]
    },
    {
      "id": "REQ-14",
      "text": "Display the logged-in user's principal ID in the chat header/profile area after login. In `frontend/src/components/ChatHeader.tsx`, show the authenticated user's principal ID (as a truncated or full string) inside the user dropdown menu or next to the user's display name, so it is visible after successful authentication.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2"
        ],
        "quotes": [
          "show id after login",
          "displaying the logged-in user's principal ID in the header/profile area"
        ]
      },
      "acceptanceCriteria": [
        "After login, the user's principal ID is visible in the ChatHeader component (e.g., inside the user dropdown or beneath the display name)",
        "The principal ID is either displayed in full or truncated with ellipsis for readability",
        "The principal ID display does not break the existing header layout or theme"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All Motoko logic must remain in the single actor file backend/main.mo",
    "Do not change existing backend data model or remove any existing API functions"
  ],
  "nonGoals": [
    "Adding new chat features or conversation functionality",
    "Changing the overall visual theme or color palette",
    "Implementing group chats or multi-user conversations",
    "Adding a separate profile settings page"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}