{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix post-login request errors and display principal ID in header",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Fix backend call failures after login by ensuring the frontend actor interface and registerUser mutation match the deployed backend API",
      "acceptanceCriteria": [
        "After logging in with Internet Identity, no 'Error in sending request' toast or console error appears",
        "The registerUser mutation successfully creates a user profile on first login",
        "The frontend useQueries.ts actor interface types match the deployed backend API exactly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the actor interface to match the backend API exactly. Ensure registerUser is defined as registerUser(displayName: string): Promise<void> matching the backend signature. Verify all actor method signatures match the types in frontend/src/backend.d.ts. Update the useSaveProfile mutation to correctly invoke actor.registerUser(profile.name) with the display name argument."
        },
        {
          "path": "frontend/src/pages/SetupPage.tsx",
          "operation": "modify",
          "description": "Ensure the registerUser mutation is invoked correctly with the display name argument. Verify the mutation calls actor.registerUser(displayName) (not actor.saveCallerUserProfile). Add error boundary handling to catch and display any request errors with specific error messages. Ensure the onSuccess callback invalidates the currentUserProfile query to refresh the user state after successful registration."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Display the logged-in user's principal ID in the ChatHeader component after authentication",
      "acceptanceCriteria": [
        "After login, the user's principal ID is visible in the ChatHeader component (e.g., inside the user dropdown or beneath the display name)",
        "The principal ID is either displayed in full or truncated with ellipsis for readability",
        "The principal ID display does not break the existing header layout or theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatHeader.tsx",
          "operation": "modify",
          "description": "Add display of the logged-in user's principal ID inside the user dropdown menu. Import useInternetIdentity hook to access the identity object. Extract the principal ID using identity?.getPrincipal().toString(). Display the principal ID beneath the display name in the dropdown menu, either truncated (e.g., first 8 and last 4 characters with ellipsis) or in full. Style the principal ID text with smaller font size and muted color (text-muted-foreground) to maintain visual hierarchy. Ensure the layout remains responsive and does not overflow on mobile devices."
        }
      ]
    }
  ]
}